const language = {
	loadevent: 'Loaded player event',
	loadcmd: 'Loaded command',
	ready: ' successfully connected.',
	loadslash: 'Successfully reloaded application [/] commands.',
	error1:
		"The Bot Token You Entered Into Your Project Is Incorrect Or Your Bot's INTENTS Are OFF!",
	error2:
		'Please set the bot token in token.js or in your .env file in your project!',
	loadclientevent: 'Loaded client event',
	embed1:
		'يجب ان يكون لديك رتبة <@&{djRole}>(DJ) في هذا السيرفر من اجل استخدام هذا الأمر. المستخدمين بدون هذه الرتبة لايستطيعون استخدام {cmdMAP}',
	message1: 'انت لست متصل بقناة صوتية. ',
	message2: 'انت لست في نفس القناة الصوتية التي انا بها. ',
	message3: 'تفتقد الى الإذن',
	msg4: 'حدث خطأ ما',
	msg5: 'لايوجد موسيقى تشتغل حاليا. ',
	msg6: 'احفظ الموسيقى',
	msg7: 'اكتب اسم قائمة التشغيل.',
	msg8: 'هذه الموسيقى يتم بثها, لا يوجد معلومات مدة لعرضها. 🎧',
	msg9: '** نجاح:** معلومات الوقت حدثت.',
	msg10: 'انت ليس لديك قائمة تشغيل بهذا الأسم. ',
	msg11: 'هذه الموسيقى موجودة بالفعل في قائمة الشتغيل هذه. ❌',
	msg12: 'أضيفت الى قائمة تشغيل الموسيقى الخاصة بك.',
	error3: 'Error reloading application [/] commands: ',
	error4:
		"WARN: It looks like you didn't write the mongodb url? If you do not enter a valid mongodb url in the config.js file, you will not be able to use the bot.",
	msg13: ` الأن يشغل:`,
	msg14: 'الطابور فارغ حالياً. يرجى إضافة المزيد من الموسيقى للاستمتاع.',
	msg15: 'لقد فقدت الأتصل لأن لا احد متبقي في قناتي. ',
	msg16:
		'لدي مشكلة في الأتصال بالقناة الصوتية.  مثل شخص ما قام بقطع اتصالي؟ انا حزين جدا. 😔',
	msg17: 'لايوجد مقطوعة سابقة! ',
	msg18: 'الأن يشغل **{queue.previousTracks[1].title}**. ',
	msg19: ' إحصائيات البوت',
	msg20: 'تحديث',
	msg21: '**انتهى وقتك!**',
	msg22: '**✅ تم تحديث المعلومات.**',
	msg23: 'قائمة الانتظار فارغة. ',
	msg24: 'تم مسح قائمة الانتظار. 🗑️',
	msg26: 'اذا لم تحدد رتبة DJ, فإنك لن تستطيع استخدام الأمر!',
	msg25: 'لقد تم تعيين رتبة DJ الى <@&{role}> بنجاح.',
	msg27: 'تم حذف رتبة DJ بنجاح.',
	msg28: 'لم يتم تعيين رتبة DJ.',
	msg29: `يرجى منك ادخال فلتر صالح. ❌\n{filters}`,
	msg30: `لم أستطع العثور على فلتر بهذا الأسم. ❌\n{filters}`,
	msg31: `تم استعمال: **{filter}**, نتيجة الفلتر: **{status}**\n **تذكر, اذا الموسيقى طويلة, قد يكون وقت تطبيق الفلتر أطول وفقا لذلك.`,
	msg32: `
		Hello <@{interaction.user.id}>!
أهلاً بك في **{client.user.username} صفحة مساعدة الأوامر!**

**Instruction**

> استخدم **/** كالمقدمة العامة.
> استخدم **/help [متبوعًا بسؤالك لطرح أي شيء على الذكاء الاصطناعي الخاص بنا]** لرؤية التفاصيل الواضحة.

**Music Control Panel Button Instruction**

> زر ◀️ لتشغيل الموسيقى السابقة.
> 
> زر ⏸️ لإيقاف الموسيقى مؤقتاً.
> 
> زر ⏯️ لاستئناف الموسيقى.
> 
> زر ▶️ لتخطي الموسيقى الحالية.
> 
> زر 📃 لإظهار كلمات الأغاني.
> 
> زر ⏹️ لإيقاف الموسيقى.
> 
> زر <:save:1117815593043775569> لحفظ الموسيقى في قائمتك المفضلة.
> 
> زر 🔀 لخلط الموسيقى في الطابور.
> 
> زر <:download:1230868574722064446> لتنزيل الموسيقى عبر gdrive.
> 
> زر <:autoplay:1230869965435961394> لتشغيل أو إيقاف التشغيل التلقائي للطابور.

**Bot Information**

> ***help, statistic, invite, ping.***

**Music Commands**

> ***play music, play next, play playlist, search.***

**Music Control**

> ***autoplay, volume, shuffle, loop, filter, seek, remove, move, clear, back, skip, pause, resume, stop.***

**Music Information**

> ***nowplaying, lyrics, download, queue, time, suggest.***

**Playlist Commands**

> ***playlist create, playlist delete, playlist add-music, playlist delete-music, playlist lists, playlist top, save.***

**Admin Server Commands**

> ***channel add, channel remove, dj set, dj reset, language.***

**Feedback**

> ***feedback, report.***

تبحث عن مكان للتسكع أو الإبلاغ عن الأخطاء أو تقديم الملاحظات؟ انضم إلى [The Great Empire]({config.support}) وتواصل مع محبي الموسيقى الآخرين!

[Invite Me]({config.botInvite}) • [Support Server]({config.support2}) • [Vote]({config.voteManager.vote_url}) • [Website]({config.supportServer}) • [Sponsor]({config.sponsor.url})
		`,
	msg33: 'أوامر البوت',
	msg34: 'لديك بالفعل أمر ناشط هنا. ❌',
	msg35: 'قائمة الأنتظار',
	msg36: 'الموسيقى المشغلة',
	msg37: 'إغلاق التكرار',
	msg38: 'نظام التكرار',
	msg39: `> **ماذا عن الاختيار?**
>
> **قائمة الأنتظار:** يكرر قائمة الإنتظار.
> **يتم الآن تشغيل الموسيقى:** يكرر تشغيل الموسيقى الحالية.
> **إغلاق التكرار:** تغلق التكرار.`,
	msg40: 'وضع تكرار قائمة الإنتظار',
	msg41: 'حدث خطأ ما. ',
	msg42: 'يتم الآن تشغيل وضع تكرار الموسيقى',
	msg43: 'وضع التكرار غير نشط بالفعل. ',
	msg44: `وضع التكرار  **مغلق** `,
	msg45: 'انتهى الوقت',
	msg46: 'نظام التكرار - أنتهى',
	msg47: 'حقظ قائمة الإنتظار',
	msg48: 'تم ايقاف الموسيقى مؤقتا! ',
	msg49: `بنق الرسالة`,
	msg50: `تأخير الرسالة`,
	msg51: `تأخير API`,
	msg52: `لا يوجد هناك قائمة تشغيل. `,
	msg53: `ليس لديك الإذن لتشغيل قائمة التشغيل هذه. `,
	msg54: `ليس لديك موسيقى بهذا الأسم. `,
	msg55: `لايمكنني الإنضمام الى قناتك الصوتية. <a:Cross:1116983956227772476>`,
	msg56: `يتم تحميل قائمة التشغيل... `,
	msg57: `<@{interaction.member.id}>, أضيفت **{music_filter.length}** مقطوعة إلى قائمة الانتظار. `,
	msg58: `لايوجد قائمة انتظار بهذا الأسم. `,
	msg59: `اكتب اسم المقطوعة التي تريد تريد البحث عنها. `,
	msg60: `لا يوجد نتائج! `,
	msg61: 'يتم تحميل الموسيقى... ',
	msg62: 'تمت إضافة القائمة المسماة إلى قائمة التشغيل. ',
	msg63: `قائمة التشغيل فارغة. `,
	msg64: 'قائمة موسيقى السيرفر',
	msg65: 'يشغل حاليا',
	msg66: 'مطلوبة من',
	msg67: 'الصفحة',
	msg68: `تم إلغاء معالج الأوامر. `,
	msg69: `قائمة موسيقى السيرفر - انتهى الوقت!`,
	msg70: `انتهى وقتك, لإستخدام هذا الأمر يجب عليك كتابة \`/queue\` لإستخدام الأمر مرة اخرى`,
	msg71: `حدث خطأ ما. يبدو بأنك لم توقف الموسيقى مسبقا.`,
	msg72: 'استئنقت المقطوعة! ',
	msg73: `يرجى منك إدخال اسم موسيقى صالح. `,
	msg74: `لم يتم العثور على نتائج بحث! `,
	msg75: 'الموسيقى المبحوثة',
	msg76: 'أختر موسيقى من **1** الى **{maxTracks.length}** ⬇️',
	msg77: `بحث الموسيقى الغي. `,
	msg78: `يتم التحميل... 🎧`,
	msg79: 'اضيف الى قائمة الإنتظار. ',
	msg80: `انتهت صلاحية وقت بحث الموسيقى `,
	msg81: 'الغاء',
	msg82: `الرقم الذي ادخلته اكبر من عدد الموسيقى في قائمة الإنتظار. `,
	msg83: 'تم تخطي الموسيقى ',
	msg84: `هذه الموسيقى يتم بثها, لا يوجد معلومات مدة لعرضها. 🎧`,
	msg85: `توقفت الموسيقى. شكرا لك على استخدام خدمتنا. `,
	msg86: 'تحديث',
	msg87: `الفولم الحالي: **{queue.volume}** <a:Musicon:1116994369833144350>\n**لتغيير الفولم اختر, من \`1\` الى \`{maxVol}\`.**`,
	msg88: `الفولم الذي تحاول تغييره هو بالفعل الفولم الحالي `,
	msg89: `**أكتب رقم من \`1\` الى \`{maxVol}\` لتفيير الفولم .** `,
	msg90: 'الفولم تغير:',
	msg91: `أكتب اسم قائمة التشغيل التي تود انشائها. ❌`,
	msg92: `قائمة تشغيل بهذا الأسم موجودة بالفعل. ❌`,
	msg93: `لا يمكن ان يكون لديك اكثر من 30 قائمة تشغيل. ❌`,
	msg94: 'يتم انشاء قائمة التشغيل... 🎧',
	msg95: 'تم انشاء قائمة التشغيل! 🎧',
	msg96: `ليس لديك قائمة تشغيل بهذا الأسم. ❌`,
	msg97: 'يتم حذف قائمة التشغيل... 🎧',
	msg98: 'قائمة التشغيل حذفت! 🎧',
	msg99: `أكتب اسم المقطوعة التي تريد البحث عنها. ❌`,
	msg100: `اكتب اسم قائمة التشغيل التي تريد إضافة الموسيقى إليها. ❌`,
	msg101: `لا يمكن ان يكون لديك اكثر من {max_music} موسيقى في قائمة التشغيل. ❌`,
	msg102: 'يتم تحميل الموسيقى... 🎧',
	msg103: 'تمت إضافة جميع الموسيقى إلى قائمة التشغيل الخاصة بك! 🎧',
	msg104: `هذه الموسيقى موجودة بالفعل في قائمة التشغيل هذه. `,
	msg105: 'أضيفت إلى قائمة التشغيل! 🎧',
	msg106: `اكتب اسم قائمة التشغيل التي تريد حذف الموسيقى منها. ❌`,
	msg107: `ليس لديك موسيقى بهذا الاسم. ❌`,
	msg108: 'يتم حذف الموسيقى... 🎧',
	msg109: 'تم حذف الموسيقى! 🎧',
	msg110: 'اكتب اسم قائمة التشغيل التي تريد البحث فيها. ❌',
	msg111: `ليس لديك أي موسيقى في قائمة التشغيل هذه. ❌`,
	msg112: 'أفضل قوائم تشغيل عامة',
	msg113: `لقد انتهى وقتك لاستخدام هذا الأمر, يمكنك كتابة \`/playlist top\` لاستخدام الأمر مرة أخرى.`,
	msg114: `لا يوجد قائمة تشغيل عامة. ❌`,
	msg115: 'قوائم التشغيل الخاصة بك',
	msg116: `موسيقى`,
	msg117: `ليس لديك أي قائمة تشغيل. ❌`,
	msg118:
		'لقد انتهى وقتك لاستخدام هذا الأمر, يمكنك كتابة `/playlist list {name}` لاستخدام الأمر مرة أخرى.',
	msg119:
		'استخدم الأمر **/play playlist <list-name>** للاستماع إلى قوائم التشغيل هذه. \nأكتب **/playlist list <list-name>** لرؤية الموسيقى في القائمة.',
	msg120: 'يرجى تحديد قناة نصية.',
	msg121:
		'تمت إضافة <#{channel}> إلى قائمة قنوات استخدام الأوامر, والآن يمكن استخدام أمر البوت فقط على القنوات الموجودة في القائمة.',
	msg122: 'لا توجد بيانات مسجلة.',
	msg123: '<#{channel}> تم حذفه من قائمة قنوات استخدام الأوامر',
	msg124: 'هذه القناة موجودة بالفعل في قائمة قنوات استخدام الأوامر.',
	msg125: 'هذه القناة ليست قناة نصية.',
	msg126:
		' فيما يلي قائمة بالقنوات التي يمكنك التحكم بها على هذا الخادم: {channel_filter}',
	msg127: 'لم يتم تعريف الأمر.',
	error7:
		'يرجى محاولة هذا الأمر مرة أخرى في وقت لاحق. تم الإبلاغ عن خطأ محتمل لمطوري البوت.',
	msg128:
		'لقد أسكتتني أثناء تشغيل الموسيقى. لهذا أوقفت الموسيقى. إذا قمت بالتراجع عن كتم الصوت, فسأواصل. 😔',
	msg129: 'يشغل',
	msg130: 'الرجاء كتابة رقم صحيح.',
	msg131:
		'من أجل استخدام الأوامر الموجودة في القائمة, تحتاج إلى التصويت للبوت.',
	msg132: 'لا توجد موسيقى متوقفة مؤقتًا.',
	msg133: 'لقد أخطأت في الترتيب في قائمة التشغيل.',
	msg134: 'استخدام غير صحيح. مثال: `5:50` | `1:12:43`',
	msg135: 'تم ضبط وقت التشغيل على {queue.formattedCurrentTime} بنجاح',
	msg136:
		'التشغيل التلقائي قيد التشغيل الآن. سأقوم بتشغيل الموسيقى العشوائية من الآن فصاعدًا.',
	msg137: 'تم إيقاف التشغيل التلقائي حاليًا.',
	msg138: 'القناة: **{queue?.connection.channel.name}** ',
	msg142: 'تم حذف المسار {trackName}.',
	msg143: 'المدة',
	msg144: 'الأغنية التالية',
	msg145: 'الوقت المقدر حتى العرض',
	msg146: 'الوقت المقدر',
	msg147: 'موقف الانتظار',
	msg148:
		'لقد انتظرت لمدة 3 دقائق، ولكن للأسف، لا يوجد موسيقى تشغيلها. شكرًا لاختياركم لخدمتنا.',

	msg149: 'تم نقل **{trackName}** من المسار {fromOrder} إلى المسار {toOrder}',
};
module.exports = language;
